nce2-4/L90.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-10-08 Sun 14:28 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="author" content="lenovo" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">

<div id="outline-container-org94fd7a7" class="outline-2">
<h2 id="org94fd7a7">Lesson 90 What's for supper?</h2>
<div class="outline-text-2" id="text-org94fd7a7">
<p class="verse">
What kind of fish are they?<br />
<br />
Fish and chips has always been a favourite dish in Britain,<br />
&#xa0;but as the oceans have been overfished,<br />
&#xa0;&#xa0;fish has become more and more expensive.<br />
So it comes as a surprise to learn<br />
&#xa0;that giant fish are terrifying the divers on North Sea oil rigs.<br />
Oil rigs have to be repaired frequently<br />
&#xa0;and divers, who often have to work in darkness a hundred feet under water,<br />
&#xa0;&#xa0;have been frightened out of their wits<br />
&#xa0;&#xa0;&#xa0;by giant fish bumping into them as they work.<br />
Now they have had special cages made to protect them from these monsters.<br />
The fish are not sharks or killer whales,<br />
&#xa0;but favourite eating varieties like cod and skate<br />
&#xa0;&#xa0;which grow to unnatural sizes,<br />
&#xa0;&#xa0;&#xa0;sometimes as 10 much as twelve feet in length.<br />
Three factors have caused these fish to grow so large:<br />
&#xa0;the warm water round the hot oil pipes under the sea;<br />
&#xa0;the plentiful supply of food thrown overboard by the crews on the rigs;<br />
&#xa0;the total absence of fishing boats around the oil rigs.<br />
As a result, the fish just eat and eat and grow and grow in the lovely warm water.<br />
Who eats who?<br />
</p>
</div>

<div id="outline-container-org568722c" class="outline-3">
<h3 id="org568722c">words</h3>
<div class="outline-text-3" id="text-org568722c">
<p>
chip [tʃɪp] n.油煎土豆皮<br />
overfish [ˌoʊvə'fɪʃ] v.过度捕捞<br />
giant [ˈdʒaɪənt] adj.巨大的<br />
terrify [ˈterəˌfaɪ] v.吓,使恐怖<br />
diver [ˈdaɪvər] n.潜水员<br />
oil rig [ɔɪl-rɪɡ] 石油钻塔<br />
wit [wɪt] n.(复数)理智,头脑<br />
cage [keɪdʒ] n.笼<br />
shark [ʃɑrk] n.鲨鱼<br />
whale [weɪl] n.鲸<br />
variety [vəˈraɪəti] n.品种<br />
cod [kɒd] n.鳕<br />
skate [skeɪt] n.鳐<br />
factor [ˈfæktər] n.因素<br />
crew [kru] n.全体工作人员<br />
</p>
</div>
</div>
<div id="outline-container-org718a556" class="outline-3">
<h3 id="org718a556">单词造句</h3>
</div>
<div id="outline-container-orgdd41e7a" class="outline-3">
<h3 id="orgdd41e7a">反复听电影片段</h3>
</div>
<div id="outline-container-orgc40786d" class="outline-3">
<h3 id="orgc40786d">Pattern Drill 写+读</h3>
</div>
<div id="outline-container-orgcd8c357" class="outline-3">
<h3 id="orgcd8c357">给自己讲解</h3>
</div>
<div id="outline-container-orgc37a506" class="outline-3">
<h3 id="orgc37a506">红皮书</h3>
</div>
<div id="outline-container-org00e269b" class="outline-3">
<h3 id="org00e269b">习惯用法造句</h3>
</div>
<div id="outline-container-org4bb2306" class="outline-3">
<h3 id="org4bb2306">跟读至背诵</h3>
</div>
<div id="outline-container-org652ffb3" class="outline-3">
<h3 id="org652ffb3">Ask me if 写+读</h3>
</div>
<div id="outline-container-org94d4c1a" class="outline-3">
<h3 id="org94d4c1a">摘要写作</h3>
</div>
<div id="outline-container-org824994e" class="outline-3">
<h3 id="org824994e">tell the story 口语</h3>
</div>
<div id="outline-container-orga2b8dd8" class="outline-3">
<h3 id="orga2b8dd8">Topics for discussion</h3>
</div>
</div>
</div>
</body>
</html>
